test_integracion.js

#!/usr/bin/env node

/**
 * Test de integración: Verifica que el backend puede parsear las respuestas SOAP de SIFEN
 * Manual Técnico SIFEN v150
 */

const {
  extraerCodigoRetorno,
  extraerMensajeRetorno,
  extraerEstadoResultado,
  extraerEstadoDocumento,
  extraerCDC,
  extraerFechaProceso,
  extraerDigestValue
} = require('./utils/estadoSifen');

console.log('='.repeat(80));
console.log('TEST DE INTEGRACIÓN: Backend parseando respuestas SOAP de SIFEN');
console.log('Manual Técnico SIFEN v150');
console.log('='.repeat(80));

// ============================================================================
// TEST 1: Parsear respuesta de recepción (siRecepDE) - Éxito
// ============================================================================
console.log('\n1️⃣  TEST: Parsear respuesta de recepción (Éxito - 0260)');
console.log('-'.repeat(80));

const respuestaRecepcion = `<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Header/>
  <soap:Body>
    <ns2:rRetEnviDe xmlns:ns2="http://ekuatia.set.gov.py/sifen/xsd">
      <ns2:rProtDe>
        <ns2:id>01200500111001001001452812025032018431513501</ns2:id>
        <ns2:dFecProc>2026-03-03-18:51:18</ns2:dFecProc>
        <ns2:dDigVal>abc123digestvalue456</ns2:dDigVal>
        <ns2:gResProc>
          <ns2:dEstRes>Aprobado</ns2:dEstRes>
          <ns2:dProtAut>1772563878</ns2:dProtAut>
          <ns2:dCodRes>0260</ns2:dCodRes>
          <ns2:dMsgRes>Autorización satisfactoria</ns2:dMsgRes>
        </ns2:gResProc>
      </ns2:rProtDe>
    </ns2:rRetEnviDe>
  </soap:Body>
</soap:Envelope>`;

const codigoRetorno1 = extraerCodigoRetorno(respuestaRecepcion);
const mensajeRetorno1 = extraerMensajeRetorno(respuestaRecepcion);
const estadoResultado1 = extraerEstadoResultado(respuestaRecepcion);
const cdc1 = extraerCDC(respuestaRecepcion);
const fechaProceso1 = extraerFechaProceso(respuestaRecepcion);
const digestValue1 = extraerDigestValue(respuestaRecepcion);

console.log('Resultados de extracción:');
console.log(`  - codigoRetorno: ${codigoRetorno1} ${codigoRetorno1 === '0260' ? '✅' : '❌'}`);
console.log(`  - mensajeRetorno: ${mensajeRetorno1} ${mensajeRetorno1 === 'Autorización satisfactoria' ? '✅' : '❌'}`);
console.log(`  - estadoResultado: ${estadoResultado1} ${estadoResultado1 === 'Aprobado' ? '✅' : '❌'}`);
console.log(`  - cdc: ${cdc1} ${cdc1 === '01200500111001001001452812025032018431513501' ? '✅' : '❌'}`);
console.log(`  - fechaProceso: ${fechaProceso1} ${fechaProceso1 === '2026-03-03-18:51:18' ? '✅' : '❌'}`);
console.log(`  - digestValue: ${digestValue1} ${digestValue1 === 'abc123digestvalue456' ? '✅' : '❌'}`);

// ============================================================================
// TEST 2: Parsear respuesta de recepción - Rechazo (1000)
// ============================================================================
console.log('\n2️⃣  TEST: Parsear respuesta de recepción (Rechazo - 1000)');
console.log('-'.repeat(80));

const respuestaRechazo = `<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Header/>
  <soap:Body>
    <ns2:rRetEnviDe xmlns:ns2="http://ekuatia.set.gov.py/sifen/xsd">
      <ns2:rProtDe>
        <ns2:id>01200500111001001001452812025032018431513501</ns2:id>
        <ns2:dFecProc>2026-03-03-18:51:18</ns2:dFecProc>
        <ns2:dDigVal>abc123digestvalue456</ns2:dDigVal>
        <ns2:gResProc>
          <ns2:dEstRes>Rechazado</ns2:dEstRes>
          <ns2:dProtAut>0000000000</ns2:dProtAut>
          <ns2:dCodRes>1000</ns2:dCodRes>
          <ns2:dMsgRes>CDC no corresponde con las informaciones del XML</ns2:dMsgRes>
        </ns2:gResProc>
      </ns2:rProtDe>
    </ns2:rRetEnviDe>
  </soap:Body>
</soap:Envelope>`;

const codigoRetorno2 = extraerCodigoRetorno(respuestaRechazo);
const mensajeRetorno2 = extraerMensajeRetorno(respuestaRechazo);
const estadoResultado2 = extraerEstadoResultado(respuestaRechazo);
const cdc2 = extraerCDC(respuestaRechazo);

console.log('Resultados de extracción:');
console.log(`  - codigoRetorno: ${codigoRetorno2} ${codigoRetorno2 === '1000' ? '✅' : '❌'}`);
console.log(`  - mensajeRetorno: ${mensajeRetorno2} ${mensajeRetorno2.includes('CDC no corresponde') ? '✅' : '❌'}`);
console.log(`  - estadoResultado: ${estadoResultado2} ${estadoResultado2 === 'Rechazado' ? '✅' : '❌'}`);
console.log(`  - cdc: ${cdc2} ${cdc2 === '01200500111001001001452812025032018431513501' ? '✅' : '❌'}`);

// ============================================================================
// TEST 3: Parsear respuesta de consulta (siConsDE) - CDC Encontrado
// ============================================================================
console.log('\n3️⃣  TEST: Parsear respuesta de consulta (CDC Encontrado - 0421)');
console.log('-'.repeat(80));

const respuestaConsulta = `<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Header/>
  <soap:Body>
    <ns2:rResEnviConsDe xmlns:ns2="http://ekuatia.set.gov.py/sifen/xsd">
      <ns2:dFecProc>2026-03-03-18:51:18</ns2:dFecProc>
      <ns2:dCodRes>0421</ns2:dCodRes>
      <ns2:dMsgRes>CDC encontrado</ns2:dMsgRes>
      <ns2:estado>Aprobado</ns2:estado>
      <ns2:xContenDE>
        <ns2:rContDe>
          <ns2:rDE><DE>XML del documento</DE></ns2:rDE>
          <ns2:dProtAut>1234567890</ns2:dProtAut>
        </ns2:rContDe>
      </ns2:xContenDE>
    </ns2:rResEnviConsDe>
  </soap:Body>
</soap:Envelope>`;

const codigoRetorno3 = extraerCodigoRetorno(respuestaConsulta);
const mensajeRetorno3 = extraerMensajeRetorno(respuestaConsulta);
const estadoResultado3 = extraerEstadoResultado(respuestaConsulta);
const estadoDocumento3 = extraerEstadoDocumento(respuestaConsulta);
const cdc3 = extraerCDC(respuestaConsulta);
const fechaProceso3 = extraerFechaProceso(respuestaConsulta);

console.log('Resultados de extracción:');
console.log(`  - codigoRetorno: ${codigoRetorno3} ${codigoRetorno3 === '0421' ? '✅' : '❌'}`);
console.log(`  - mensajeRetorno: ${mensajeRetorno3} ${mensajeRetorno3 === 'CDC encontrado' ? '✅' : '❌'}`);
console.log(`  - estadoResultado (dEstRes): ${estadoResultado3} ${estadoResultado3 === null ? '✅ (null, no hay dEstRes en consulta)' : '❌'}`);
console.log(`  - estadoDocumento: ${estadoDocumento3} ${estadoDocumento3 === 'Aprobado' ? '✅' : '❌'}`);
console.log(`  - fechaProceso: ${fechaProceso3} ${fechaProceso3 === '2026-03-03-18:51:18' ? '✅' : '❌'}`);

// ============================================================================
// TEST 4: Parsear respuesta de consulta - CDC Inexistente (0420)
// ============================================================================
console.log('\n4️⃣  TEST: Parsear respuesta de consulta (CDC Inexistente - 0420)');
console.log('-'.repeat(80));

const respuestaConsultaError = `<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Header/>
  <soap:Body>
    <ns2:rResEnviConsDe xmlns:ns2="http://ekuatia.set.gov.py/sifen/xsd">
      <ns2:dFecProc>2026-03-03-18:51:18</ns2:dFecProc>
      <ns2:dCodRes>0420</ns2:dCodRes>
      <ns2:dMsgRes>CDC inexistente</ns2:dMsgRes>
    </ns2:rResEnviConsDe>
  </soap:Body>
</soap:Envelope>`;

const codigoRetorno4 = extraerCodigoRetorno(respuestaConsultaError);
const mensajeRetorno4 = extraerMensajeRetorno(respuestaConsultaError);

console.log('Resultados de extracción:');
console.log(`  - codigoRetorno: ${codigoRetorno4} ${codigoRetorno4 === '0420' ? '✅' : '❌'}`);
console.log(`  - mensajeRetorno: ${mensajeRetorno4} ${mensajeRetorno4 === 'CDC inexistente' ? '✅' : '❌'}`);

// ============================================================================
// TEST 5: Respuesta con formato legacy (sin namespace) - Compatibilidad
// ============================================================================
console.log('\n5️⃣  TEST: Parsear respuesta con formato legacy (sin namespace)');
console.log('-'.repeat(80));

const respuestaLegacy = `<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <recibeResponse xmlns="http://sifen.set.gov.py/">
      <return>
        <dCodRes>0260</dCodRes>
        <dMsgRes>Autorización satisfactoria</dMsgRes>
        <dEstRes>Aprobado</dEstRes>
        <dProtAut>1234567890</dProtAut>
        <cdc>01200500111001001001452812025032018431513501</cdc>
        <fechaProceso>2026-03-03 18:51:18</fechaProceso>
        <digestValue>abc123</digestValue>
      </return>
    </recibeResponse>
  </soap:Body>
</soap:Envelope>`;

const codigoRetorno5 = extraerCodigoRetorno(respuestaLegacy);
const mensajeRetorno5 = extraerMensajeRetorno(respuestaLegacy);
const estadoResultado5 = extraerEstadoResultado(respuestaLegacy);
const cdc5 = extraerCDC(respuestaLegacy);
const fechaProceso5 = extraerFechaProceso(respuestaLegacy);
const digestValue5 = extraerDigestValue(respuestaLegacy);

console.log('Resultados de extracción (compatibilidad con formato legacy):');
console.log(`  - codigoRetorno: ${codigoRetorno5} ${codigoRetorno5 === '0260' ? '✅' : '❌'}`);
console.log(`  - mensajeRetorno: ${mensajeRetorno5} ${mensajeRetorno5 === 'Autorización satisfactoria' ? '✅' : '❌'}`);
console.log(`  - estadoResultado: ${estadoResultado5} ${estadoResultado5 === 'Aprobado' ? '✅' : '❌'}`);
console.log(`  - cdc: ${cdc5} ${cdc5 === '01200500111001001001452812025032018431513501' ? '✅' : '❌'}`);
console.log(`  - fechaProceso: ${fechaProceso5} ${fechaProceso5 === '2026-03-03 18:51:18' ? '✅' : '❌'}`);
console.log(`  - digestValue: ${digestValue5} ${digestValue5 === 'abc123' ? '✅' : '❌'}`);

// ============================================================================
// RESUMEN
// ============================================================================
console.log('\n' + '='.repeat(80));
console.log('RESUMEN DE PRUEBAS DE INTEGRACIÓN');
console.log('='.repeat(80));
console.log('');
console.log('✅ El backend puede parsear correctamente las respuestas SOAP de SIFEN');
console.log('✅ Se soportan ambos formatos: SIFEN v150 (con namespace ns2:) y legacy');
console.log('');
console.log('Funciones actualizadas en utils/estadoSifen.js:');
console.log('  ✅ extraerCodigoRetorno() - Soporta <ns2:dCodRes>, <dCodRes>, <codigoRetorno>');
console.log('  ✅ extraerMensajeRetorno() - Soporta <ns2:dMsgRes>, <dMsgRes>, <mensajeRetorno>');
console.log('  ✅ extraerEstadoResultado() - Soporta <ns2:dEstRes>, <dEstRes>, <estadoResultado>');
console.log('  ✅ extraerEstadoDocumento() - Soporta <ns2:estado>, <estado>, <estadoResultado>');
console.log('  ✅ extraerCDC() - Soporta <ns2:id>, <id>, <cdc>');
console.log('  ✅ extraerFechaProceso() - Soporta <ns2:dFecProc>, <dFecProc>, <fechaProceso>');
console.log('  ✅ extraerDigestValue() - Soporta <ns2:dDigVal>, <dDigVal>, <digestValue>');
console.log('');
console.log('Archivos actualizados en server.js:');
console.log('  ✅ Líneas ~702 - Extracción en consulta de estado');
console.log('  ✅ Líneas ~886 - Extracción en refresh-status');
console.log('');
